#include <iostream>
#include <cmath>
#include <math.h>
#define PI 3.14159265;

//S2.1. Составить программу:
//а) вычисления значения функции y = 7x2 + 3x + 6 при любом значении x;
//б) вычисления значения функции x = 12a2 + 7a + 12 при любом значении а.
void FuncXA(int x, int a) {

    int y;
    y = 7 * pow(x, 2) + 3 * x + 6;
    std::cout << y << std::endl;
    
    int b;
    b = 12 * pow(x, 2) + 7 * a + 12;
    std::cout << b << std::endl;
}

//Дана сторона квадрата. Найти его периметр. 
void box(int x) {
    std::cout << "Периметр квадрата: "
    << x * 4 << std::endl;
}

//Дан радиус окружности. Найти ее диаметр. 
void circle(double x) {
    
    std::cout << "Диаметр окружности: "
    << x / PI; 
    std::cout << std::endl;

}

//Считая, что Земля — идеальная сфера с радиусом R=6350 км, определить расстояние до линии горизонта от точки В с заданной высотой h=AB над Землей.
void land(int h) {
    int R = 6350;
    std::cout << "Расстояние до линии горизонта: "
    << sqrt(h * (2 * R + h)) << std::endl;
}

//Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
void cube(int a) {

    std::cout << "Объем куба: "
        << a * a * a << std::endl;

    std::cout << "Площадь боковой поверхности куба: "
        << 4 * a * a << std::endl;
}

//Дан радиус окружности. Найти длину окружности и площадь круга.
void radius(int r) {
    std::cout << "Длина окружности: "
        << 2 * r * PI; 
    std::cout << std::endl;

    std::cout << "Площадь круга: "
        << r * r* PI;
    std::cout << std::endl;
}

//Даны два целых числа. Найти: а) их среднее арифметическое; б) их среднее геометрическое.
void mediumAR(double n, double m) {
   
    std::cout << "Среднее арифметическое: "
        << (n + m) / 2 << std::endl;

    std::cout << "Среднее геометрическое: "
        << pow(n * m, 1./2. ) << std::endl;
}

//Известны объем и масса тела.Определить плотность материала этого тела.
void plotM(int v, int m) {
    std::cout << "Плотность тела: "
        << m/v << std::endl;

}

//Известны количество жителей в государстве и площадь его территории. Определить плотность населения в этом государстве.
void plotGOS(int p, int q) {
    std::cout << "Плотность население: "
        << p / q << std::endl;
}

//Составить программу решения линейного уравнения ax+b=0 (a ≠ 0).
void linearX(int a, int b) {
    int x = 0;
    x = a * x + b - b;
    x = a * x ;
    x = (a * x) / a;
    x = -b / a;
    std::cout << "Ответ линейного уравнения: " << x << std::endl;
}

//Даны катеты прямоугольного треугольника. Найти его гипотенузу.
void hypotenuse(int a, int b) {
    std::cout << "Гипотенуза равна: "
        << sqrt(pow(a, 2) + pow(b, 2)) << std::endl;
}

//Найти площадь кольца по заданным внешнему и внутреннему радиусам.
void ring(int R, int r) {
    std::cout << "Площадь кольца: "
        << (pow(R, 2) - pow(r, 2)) * PI; std::cout << std::endl;
}

// Даны катеты прямоугольного треугольника. Найти его периметр.
void perK(int a, int b) {
    std::cout << "Периметр треугольника: "
        <<sqrt(pow(2,2)+pow(2,2) + (a+b)) << std::endl;
}

//Даны два числа. Найти среднее арифметическое и среднее геометрическое их  модулей.
void modul(int a, int b) {
    std::cout << "Среднее арифметическое (модуль): "
        << (fabs(a) + fabs(b)) / 2 << std::endl;

    std::cout << "Среднее геометрическое (модуль): "
        << pow(fabs(a) * fabs(b), 1. / 2.) << std::endl;
}

//Даны основания и высота равнобедренной трапеции. Найти ее периметр. //ДУБЛИРУЕТСЯ
void perT(int a, int b, int h) {
    int d;
    int c;
    d = a - b / 2;
    c = sqrt(pow(h, 2) + pow(d, 2));
    std::cout << "Периметр трапеции: "
        << a + b + 2 * c << std::endl;

}

//Даны стороны прямоугольника. Найти его периметр и длину диагонали.
void diagonalT(int a, int b) {
    std::cout << "Площадь прямоугольника: "
        << a * b << std::endl;
    std::cout << "Периметр прямоугольника: "
        << (a + b) * 2 << std::endl;
    std::cout << std::endl;
}

//Даны два числа. Найти их сумму, разность, произведение, а также частное от деления первого числа на второе.
void SumRasP(int a, int b) {
    std::cout << std::endl;
    std::cout <<"Найти их сумму, разность, произведение, а также частное от деления первого числа на второе." << std::endl;
    std::cout << "Сумма: "
        << a + b << std::endl;
    std::cout << "Разность: "
        << a - b << std::endl;
    std::cout << "Произведение: "
        << a * b << std::endl;
    std::cout << "Частное: "
        << a / b << std::endl;
    std::cout << std::endl;;
}

// Даны длины сторон прямоугольного параллелепипеда. Найти его объем и площадь боковой поверхности.
void Pparallep(int a,int b, int c) {
    std::cout << "Объем: "
        << a * b * c << std::endl;
    std::cout << "Площадь: "
        << 2 * (a * b + b * c + a *c) << std::endl;
}

//Известны координаты на плоскости двух точек. Составить программу вычисления расстояния между ними.
void RastT(int a, int b) {
    std::cout << "Расстояния между точками: "
        << sqrt(pow((a-b),2)+pow((a-b),2)) << std::endl;

}

//Даны основания равнобедренной трапеции и угол при большем основании. Найти площадь трапеции.
void Ptrap(int a, int b, int c){
    std::cout << "Площадь трапеции: "
        << ((static_cast<double>(a) + b) / 2 * sin(c) / cos(c) * (b - a) / 2) << std::endl;

}

//Треугольник задан координатами своих вершин. Найти периметр и площадь треугольника.
void PiT(int xa, int ya, int xb, int yb, int xc, int yc) {
    int ab, ac, bc, p, pp;
    
    ab = sqrt(fabs(pow(xa - xb, 2)) + fabs(pow(ya - yb, 2)));
    ac = sqrt(fabs(pow(xa - xc, 2)) + fabs(pow(ya - yc, 2)));
    bc = sqrt(fabs(pow(xb - xc, 2)) + fabs(pow(yb - yc, 2)));
    p = ab + ac + bc;
    pp = p / 2;
    std::cout << "Периметр: "
        << p << std::endl;
   
    std::cout << "Площадь: "
        << sqrt(pp * (pp - ab) * (pp - ac) * (pp - bc)) << std::endl;
}

//Выпуклый четырехугольник задан координатами своих вершин. Найти площадь этого четырехугольника как сумму площадей треугольников.
int length(int x1, int x2, int y1, int y2) {
    int dl;
    dl = sqrt(pow((y2 - y1), 2) + pow((x2 - x1), 2));
    
    return dl;
}
void P4T(int x1, int y1, int x2, int y2, int x3, int y3, int x4, int y4){
    int a, b, c, d, p, p1, geron, geron1;

    a = length(x1, y1, x2, y2);
    b = length(x2, y2, x3, y3);
    c = length(x3, y3, x4, y4);
    d = length(x4, y4, x1, y1);
   
    p = (a + b + c) / 2;
    p1 = (a + c + d) / 2;

    geron = sqrt((p * (p - a) * (p - b) * (p - c)));

    geron1 = sqrt((p1 * (p1 - a) * (p1 - b) * (p1 - c)));

    std::cout << "Площадь этого четырехугольника как сумма площадей треугольников: "
        << geron + geron1 << std::endl;

}

//Известна стоимость 1 кг конфет, печенья и яблок. Найти стоимость всей покупки, если купили x кг конфет, у кг печенья и z кг яблок.
void pokupka(double x, double y, double z, double x1, double y1, double z1) {

    std::cout << "Стоимость всей покупки: "
        << (x * x1)+(y * y1)+(z * z1) << std::endl;

}

//Известна стоимость монитора, системного блока, клавиатуры и мыши. Сколько будут стоить 3 компьютера из этих элементов? N компьютеров?
void pricePC(double x, double b, double c, int N) {

    std::cout << "Стоимость 3 пк: "
        << (x + b + c) * 3 << std::endl;

    std::cout << "Стоимость N пк: "
        << (x + b + c) * N << std::endl;
}

//Возраст Тани — X лет, а возраст Мити — Y лет. Найти их средний возраст, а также определить, на сколько отличается возраст каждого ребенка от среднего значения. 
void age(int x, int y) {

    std::cout << "Средний возраст: "
        << (x + y) / 2 << std::endl;
    std::cout << "Возраст Тани отличается: "
        << fabs((x + y) / 2 - x) << std::endl;
    std::cout << "Возраст Мити отличается: "
        << fabs((x + y) / 2 - y) << std::endl;

}

//Два автомобиля едут навстречу друг другу с постоянными скоростями V1 и  V2 км/час. Определить, через какое время автомобили встретятся, если расстояние между ними было S км.
void carDrive(double v1, double v2, double s) {
    std::cout << "Авто встретятся через: "
        <<  s / (v1 + v2)  << " часа" << std::endl;

}

// Два автомобиля едут друг за другом с постоянными скоростями V1 и  V2 км/час (V1>V2). 
//Определить, какое расстояние будет между ними через 30 минут после того, как первый автомобиль опередил второй на S км.
void carDrive30min(int v1, int v2, int  s) {
        std::cout << "Расстояние: "
            << s + (v1 - v2) * 30 << " км" << std::endl;
  }
  
//Известно значение температуры по шкале Цельсия.Найти соответствующее  значение температуры по шкале : а) Фаренгейта; 
//б) Кельвина..
void temp(double C) {
    std::cout << "Фаренгейт: "
        << C * 1.8 + 32; std::cout << std::endl;
    std::cout << "Кельвинах: "
        << C + 273,15; std::cout << std::endl;

}
//У американского писателя-фантаста Рэя Бредбери есть роман «450 градусов  по Фаренгейту». Какой температуре по шкале Цельсия соответствует указанное в названии значение?
void G450() {
    std::cout << "В цельсия это будет: "
        << (450 - 32) * 5 / 9; std::cout << std::endl;
}

int main()
{
    setlocale(LC_ALL, "Russian");
    FuncXA(6, 6); // вычисления значения функции
    box(5); // периметр
    circle(5); // диаметр окружности 
    land(5); // определить расстояние до линии горизонта
    cube(5); // Найти объем куба и площадь его боковой поверхности
    radius(5); // Найти длину окружности и площадь круга
    mediumAR(1, 100);//среднее арифметическое, среднее геометрическое
    plotM(5, 10); // m - масса, v - объем.
    plotGOS(1000, 160); // p - люди, q - площадь территории.
    linearX(11, 121); // решения линейного уравнения
    hypotenuse(5, 7); // гипотенуза.
    ring(10, 5); // R - внейшний радиус, r внутрений радиус.
    perK(10, 5); // Периметр треугольника
    modul(1, 100); //среднее арифметическое, среднее геометрическое (модуль)
    perT(5, 7, 10);// a,b - основание, h -  высота.
    diagonalT(5, 12);//Найти его периметр и длину диагонали прямоугольника.
    SumRasP(16, 6); // Найти их сумму, разность, произведение, а также частное от деления первого числа на второе.
    Pparallep(2, 6, 5);//Прямоугольного параллелепипеда найти  объем и площадь боковой поверхности
    RastT(2, 6); // Вычисление расстояния между точками.
    perT(5, 7, 10);//ДУБЛИРУЕТСЯ ЗАДАНИЕ S2.14||S2.18
    Ptrap(15, 11, 40);//Найти площадь трапеции
    PiT(1, 1, 1, 5, 6, 7); // Найти периметр и площадь треугольника
    P4T(5, 2, 3, 4, 4, 5, 6, 3);//Найти площадь этого четырехугольника как сумму площадей треугольников !!!!!!!!!!!!!!!!!!!!!!!
    pokupka(2, 4, 5, 2.5, 5.0, 7.2);//Известна стоимость 1 кг конфет, печенья и яблок. Найти стоимость всей покупки, если купили x кг конфет, у кг печенья и z кг яблок
    pricePC(21.6 ,22.6, 13.2, 6);// Cтоимость пк
    age(5, 10); //1 возраст Тани, 2 возраст Мити
    carDrive(10, 20, 100);// v1, v2, S;
    carDrive30min(15, 10, 100); // v1, v2, S;
    temp(31);// цельсий
    G450(); //«450 градусов  по Фаренгейту»
    return 0;
}


